insert into lawsNet.tb_case (id, content, judgment, isShow, power, time)
values  (1, '## 学龄前儿童权益如何保护
2017年8月30日下午17时，王某在某幼儿园分园游乐场玩耍，当时正值幼儿园放学，老师们催促幼儿及时离开，王某从游乐场跑向幼儿园门口时，被堆放在游乐场上的建筑垃圾绊倒，王某的胳膊碰在裸露在地面的石头上（当时游乐场正在维修，未设置警戒线和注意告示牌），导致王某左胳膊严重受伤。
王某父母多次前往幼儿园及教育部门要求协商处理此事，但幼儿园及主管部门一味的推卸责任，无奈，王某的父母代王某提起诉讼主张赔偿。
', '## 法律适用条文：
**《民法典》第20条**：不满八周岁的未成年人为无民事行为能力人，由其法定代理人实施民事法律行为。

《民法典》第1199条：无民事行为能力人在幼儿园、学校或者其他教育机构学习、生活期间受到人身损害的，幼儿园、学校或者其他教育机构应当承担侵权责任；但是，能够证明尽到教育、管理职责的，不承担侵权责任。

**案件处理结果及分析意见：**
一审人民法院判决王某监护人和被告幼儿园各承担50%的责任。被告幼儿园不服一审判决，提起上诉后，二审法院经审理判决驳回上诉，维持原判。

本案王某即无民事行为能力人在尚未离开幼儿园时受到伤害。根据《民法典》第1199条规定，无民事行为能力人在幼儿园受到伤害的，幼儿园主张不承担责任，应举证证明没有过错，只要幼儿园不能证明其无过错，即推定幼儿园存在过错。本案中，王某的母亲未能及时阻止王某在存有安全隐患的场地玩耍，存在一定过错，可以适当减轻幼儿园的责任。

现实中，谁来为学龄前儿童受到的伤害来买单呢？学校和无民事行为能力人究竟如何承担责任?这是学校和学生家长都十分关注的问题，也是司法审判实践中碰到的难题，因此，在现有法律规定下，法官的自由裁量权显得尤为重要。', '已发布', 0, '2022-05-08 12:09:43'),
        (2, '## 打印遗嘱有没有法律效力 
2015年，西部某市审理了一起继承权纠纷，对同一份电脑打印的遗嘱，一审法院、二审法院作出了不同的判决结果。 该份打印遗嘱是一位李姓老人所留。老人与前妻有两个子女，再婚后买了一套房。在遗嘱中，老人将这套房子的一半，以及社会保险部门结算的费用，都留给了妻子。遗嘱的签名处，老人写了自己的名字并按了手印。 老人因病死亡后，其妻提起诉讼，要求按照遗嘱继承房产。 但是老人的两个子女不同意，认为遗嘱不真实，是受继母胁迫所写，不具有法律效力；房子是父亲一人出资购买的，作为遗产应依继承法规定按份额划分。
', '## 法律适用条文：
**《民法典》第一千一百三十三条：** 自然人可以依照本法规定立遗嘱处分个人财产，并可以指定遗嘱执行人。自然人可以立遗嘱将个人财产指定由法定继承人中的一人或者数人继承。自然人可以立遗嘱将个人财产赠与国家、集体或者法定继承人以外的组织、个人。自然人可以依法设立遗嘱信托。

**《民法典》第一千一百三十六条：** 打印遗嘱应当有两个以上见证人在场见证。遗嘱人和见证人应当在遗嘱每一页签名，注明年、月、日。

**案件的处理结果及分析意见：**
一审法院审理后认为，遗嘱系老人借助设备而形成的自书遗嘱，有其本人签名捺印，符合法律规定，应认定合法有效。

两个子女不服，提起上诉。二审法院审理后认为，尽管老人在遗嘱中签名捺印，但不符合继承法中对自书遗嘱的“自己书写”“自己签名”并“自己注明年、月、日”的要件要求，故不具有自书遗嘱的效力。在无遗嘱继承的情况下，应当按照法定继承来处理被继承人的遗产，最终判决两个子女与继母按份额划分遗嘱中的房产。

该案的焦点在于，如何界定打印遗嘱？打印遗嘱是不是自书遗嘱？有没有法律效力？

随着电脑的普及，不少老人开始使用打印遗嘱。现行继承法只对自书遗嘱、代书遗嘱、录音遗嘱、口头遗嘱作出了规定，并没有涉及打印遗嘱。民法典继承编则补上了这一空白点，除自书遗嘱、代书遗嘱、录音遗嘱、口头遗嘱之外，将打印遗嘱、录像遗嘱也列入到遗嘱的形式中，并对打印遗嘱的构成要件作出了要求，即打印遗嘱应当有两个以上见证人在场见证。遗嘱人和见证人应当在遗嘱每一页签名，注明年、月、日。', '已发布', 0, '2022-05-08 12:11:43'),
        (3, '## 要求退回打赏有法律依据
12岁的小明在妈妈网购时偶尔看到付款密码，他用妈妈的手机看直播，一时冲动私自给主播打赏7万元，妈妈事后发现，能追回打赏吗？
', '## 法律适用条文：
**《民法典》第十九条规定：**八周岁以上的未成年人为限制民事行为能力人，实施民事法律行为由其法定代理人代理或者经其法定代理人同意、追认；但是，可以独立实施纯获利益的民事法律行为或者与其年龄、智力相适应的民事法律行为。

**第一百四十五条规定：**限制民事行为能力人实施的纯获利益的民事法律行为或者与其年龄、智力、精神健康状况相适应的民事法律行为有效；实施的其他民事法律行为经法定代理人同意或者追认后有效。

相对人可以催告法定代理人自收到通知之日起三十日内予以追认。法定代理人未作表示的，视为拒绝追认。民事法律行为被追认前,善意相对人有撤销的权利。撤销应当以通知的方式作出。', '已发布', 0, '2022-05-08 12:12:43'),
        (8, '## 故意导致动物侵权的责任承担
王某养了一只名叫“悠悠”的蝴蝶犬，王某甚是喜爱，每日下班后都带悠悠在小区散步，且多次向邻居夸赞悠悠性格温和、聪明灵活。教师节的早上，王某发现悠悠情绪不佳，遂带悠悠前去宠物医院进行检查。医生诊断为积食，建议悠悠多运动。
王某在小区中未看到人，为方便悠悠运动，即解开了悠悠绳子，刚解开就接到了客户的电话。突然，王某听到不远处传来狗叫声及哭声，才发现路过的刘某被悠悠咬伤。经询问同行的唐某得知，刘某想抱悠悠玩，因悠悠不配合，刘某即用提包砸向悠悠，结果被悠悠咬伤。
刘某共计花费医疗费x元，现刘某要求王某支付全部医疗费。王某辩称，因刘某挑逗悠悠、砸悠悠才致使刘某被悠悠咬伤，因此其不应当支付向刘某支付医疗费。王某是否应向刘某支付医疗费？
', '## 法律适用条文：
**《中华人民共和国侵权责任法》第七十九条：**“违反管理规定，未对动物采取安全措施造成他人损害的，动物饲养人或者管理人应当承担侵权责任。”

**《中华人民共和国民法典》第一千二百四十六条：**违反管理规定，未对动物采取安全措施造成他人损害的，动物饲养人或者管理人应当承担侵权责任；但是，能够证明损害是因被侵权人故意造成的，可以减轻责任。

**案件的处理结果及分析意见：**
根据侵权责任法的规定，王某作为悠悠的饲养人，应当对悠悠采取相关的安全措施，但其在公众场所未给悠悠佩戴相关的安全措施，致使悠悠咬伤刘某，尽管刘某存在过错，王某仍应承担全部赔偿责任。
根据民法典的规定，尽管王某作为悠悠的饲养人在公众场所未按管理规定对悠悠采取相关的安全措施，但刘某受伤系因其用提包砸悠悠导致的，其自身存在过错。因此，可以减轻王某的责任', '已发布', 0, '2022-05-08 12:13:43'),
        (10, '## 玩冲浪意外撞伤，受害者是否自甘风险
2017年11月19日，张某、王某两名冲浪爱好者在深圳一海域自行进行冲浪训练。起浪后，张某乘浪往沙滩方向前进，未观察前面仍在候浪的王某，连人带冲浪板直接撞向王某，造成王某眼睛、鼻梁受伤。
经司法鉴定，王某的伤残等级一处八级、一处十级。事故发生后，张某陪同王某到医院就诊，支付了医保之外的医疗费、伙食费等费用，并拿出5万元作为补偿。但王某认为张某应当承担事故全部责任，在前期费用之外赔偿其各项损失44万余元。
', '## 法律适用条文：
**《民法典》第一千一百六十五条： ** 行为人因过错侵害他人民事权益造成损害的，应当承担侵权责任。依照法律规定推定行为人有过错，其不能证明自己没有过错的，应当承担侵权责任。

**《民法典》第一千一百七十六条：**  自愿参加具有一定风险的文体活动，因其他参加者的行为受到损害的，受害人不得请求其他参加者承担侵权责任；但是，其他参加者对损害的发生有故意或者重大过失的除外。活动组织者的责任适用本法第一千一百九十八条至第一千二百零一条的规定。

**案件的处理结果及分析意见：**
张某应不应当承担事故全部责任？对此存在两种不同意见。一种观点认为，张某构成过失侵权，应引入过失比例分配原则决定其承担的赔偿责任。另一种观点则认为，冲浪属于高风险运动，每一个参与者都应当对冲浪的潜在危险有预见认知及承受能力，只要张某不是故意、恶意撞人，王某就应自甘风险。

法院经审理认为，王某与张某在冲浪练习过程中，王某在候浪区，张某在追浪且享有优先权，发生碰撞导致王某的眼睛被冲浪板击中，并非因张某违反运动规则或主观故意导致，因此双方对损害的发生均无过错。张某对王某进行了适当补偿，无需再支付其他费用，驳回了王某的全部诉讼请求。

该案主审法官表示，该案审判时适用了“自甘风险”规则。“自甘风险”即知道有风险，而自己自愿去冒风险，那么当风险发生后，就应当自己承担损害后果。不少国家的法律都将“自甘风险”纳入到侵权行为的免责事由之中，不过我国现行侵权责任法对此并未作出规定。

民法典侵权责任编则明确写入了“自甘风险”原则，规定受害人自愿参加具有一定风险的文体活动，因其他参加者的行为受到损害的，受害人不得请求其他参加者承担侵权责任；但是，其他参加者对损害的发生有故意或者重大过失的除外。', '已发布', 0, '2022-05-08 12:10:26'),
        (11, '## 追赶肇事车致事故算“自助免责”吗
2017年8月，林某搭乘同学石某驾驶的摩托车，途经一百货商店时，剐蹭了一辆小轿车。两人担心小轿车车主索赔，赶紧继续驾车离开。小轿车紧跟在后面，石某遂超速行驶，开到一平直路段时，摩托车先与道路北侧的路肩发生擦撞，之后就一头撞上停在人行道的面包车，林某、石某受伤。
出院后，林某把小轿车车主告到法院，认为小轿车车主如果不强行追赶，交通事故应该不会发生。虽然交警认定驾驶摩托车的石某承担交通事故的全部责任，但小轿车车主强行追赶行为是导致交通事故发生的主要原因，要求小轿车车主承担相应责任，赔偿他的损失。
', '## 法律适用条文：
**《民法典》第一千一百七十七条：**  合法权益受到侵害，情况紧迫且不能及时获得国家机关保护，不立即采取措施将使其合法权益受到难以弥补的损害的，受害人可以在保护自己合法权益的必要范围内采取扣留侵权人的财物等合理措施；但是，应当立即请求有关国家机关处理。受害人采取的措施不当造成他人损害的，应当承担侵权责任。

**案件的处理结果及分析意见：**
法院审理后认为，小轿车车主并不是这起交通事故的责任主体，不应承担责任。

林某不服，提起上诉。二审法院认为，小轿车车主在追赶过程中，未对摩托车采取左右逼停等危险驾驶行为，也未与摩托车发生摩擦和碰撞。石某发现小轿车在追赶后，不但未停下反而继续超速行驶。小轿车车主的追赶行为并未超过必要限度，与交通事故的发生不存在必然的因果关系，终审判决驳回林某的上诉请求。

承办该案的法官称，小轿车车主的追赶行为属于自助行为。我国现行法律尚未规定自助行为，但在司法实践中一般均对必要限度内的自助行为予以承认。

民法典侵权责任编补上了民事自助行为免责这一立法空白点，明确“自助免责”的三个前提条件：合法权益受到侵害；情况紧迫且不能及时获得国家机关保护；不立即采取措施将使合法权益受到难以弥补的损害。符合这三个条件，受害人可以在保护自己合法权益的必要范围内采取扣留侵权人的财物等合理措施；但是，应当立即请求有关国家机关处理。受害人采取的措施不当造成他人损害的，应当承担侵权责任。', '已发布', 0, '2022-05-08 12:10:25'),
        (13, '# 未成年人是否享有著作权？
公民和法人的民事权利能力读小学的赵勇在市教委组织的儿童绘画比赛中获得了一等奖。市教委下属的一家美术杂志社闻讯后即来信表示，他们将出一期儿童作品专刊，希望赵勇能寄来几幅作品供他们挑选。赵勇的父亲赵量收信后给杂志社寄去了三幅作品，但之后一直没有回音。第二年6月，赵量在该杂志社的期刊上发现有赵勇的两幅作品但没有给赵勇署名，便立即找到杂志社，质问为何不通知他作品已被选用，而且既不支付稿酬也不署名。然而该杂志社称，赵勇年仅8岁，还是未成年人，还不能享有著作权，因此没必要署名;杂志社发表赵勇的作品是教委对其成绩的肯定，没有必要支付稿酬。

#### [问题] 根据我国法律，赵勇是否有署名的权利和获得报酬的权利?
', '# 法律适用条文：

《中华人民共和国民法通则》第9条规定：“公民从出生时起到死亡时止，具有民事权利能力，依法享有民事权利，承担民事义务。”第10条规定：“公民的民事权利能力一律平等。”因此，无论是成年人还是未成年人，都平等地享有民事权利能力。著作权是一项民事权利，它包括作者署名权和获得报酬权。赵勇完全享有著作权，也当然享有署名权和获得报酬权。', '已发布', 0, '2022-05-08 12:10:21'),
        (14, '# 高空投物人身伤害：
原告蒋祥发原是中国十八冶金建设公司第三工程公司的电工。20xx年9月27日早晨6时许，当他途经文华大厦B座路段时，被该楼一住户抛下的一个装满重达两公斤左右泥土的塑料花盆击中头部，当即倒地昏死过去。之后，蒋被人送到医院抢救治疗，先后花去医药费7.1万余元。20xx年9月25日，经市法医验伤所鉴定，蒋有轻度智能障碍，且伴有外伤性癫痫，属7级伤残。由于出事之后一直查不出是哪家住户扔下的花盆，7万多元的医药费使蒋祥发背下了沉重的债务。于是，他一纸诉状将文华大厦B座55户住户全部告上了法庭，要求这些住户共同赔偿医疗费、后续医疗费等各项费用25万余元。

', '# 案件分析：

- 法庭上，蒋祥发的代理律师认为，花盆是从文华大厦3、4单元抛下的，由于这起高空抛物伤人案一直无法查到肇事者，按照法律规定，该民事案件应由文华大厦整栋楼的住户共同承担相关法律责任。
- 分析：按照侵权行为法的一般理论，侵权损害赔偿请求权的行使必须有特定的相对人，进而由此基础上证明侵权责任构成的其他要件。而在此种较为特殊的侵权行为中，由于被告往往难以确定，而导致被害人处于极为不利的地位，致使被害人的权利难以得到救济，从而违反了公平正义的自然法理念。', '已发布', 0, '2022-05-08 12:10:36'),
        (18, '# CivilCodeProject
### 一个关于民法典的学习网站，本人的毕设

（首页的搜索功能无效）



##### 项目基于ssm以及mybatis框架，数据库采用mysql，后端基于ssm以及mybatis框架，数据库采用mysql，前端采用bootstrap+jquery架构
', '1. 首页有轮播图展示和章节导航，上方有具体的功能模块

1. 用户分管理员和普通用户，管理员可以禁言，删除用户和编辑文章

1. 民法问答有三个问卷，可以在答题记录看到自己和他人的答题情况

1. 案件实例里有案件展示和留言版，留言功能面向所有用户
1. 法律全文可以在单页面检索章节

1. 管理员登陆后，跳转到首页通过右上角可以进入用户管理界面看到所有用户，可以禁言和删除用户，禁言的用户无法在留言板留言

1. 管理员进入用户管理界面后，可以对案件实例模块的文章进行编辑，包括发表新文章，删除文章，编辑现有文章，设置文章权重（权重越高显示位置越靠前）', '已发布', 10, '2022-05-08 12:10:38'),
        (19, '# 一键展开收起如何实现呢？

#### （这篇文章权重很高，所以显示在前面）', '# javascript的map遍历
- 定义一个display的map变量
- 后端传来数据后，为每一对“查看判决”按钮（button）和隐藏的案件判决模块（judgment）设立对于的id
- 将每一对button和judgment添加到map里面
- 为展开收起按钮创建点击事件，按钮会在展开收起两个功能直接来回切换。展开的时候，遍历每一个judgment，如果judgment是隐藏的话，则触发对应的button，遍历完map后所有未展开的judgment就会展开，而收起功能则相反
', '已发布', 5, '2022-05-08 12:10:39'),
        (21, '# SpringBoot和SSM(Spring+SpringMVC+Mybatis)有什么不同？


', '### spring的原理和组成：
```
Spring为简化我们的开发工作，封装了一
系列的开箱即用的组件功能模块，包括：
Spring JDBC 、Spring MVC 、Spring 
Security、 Spring AOP 、Spring 
ORM 、Spring Test等
```
### SpringBoot的原理和特性：
```
Spring Boot基本上是Spring框架的扩展，它消除了
设置Spring应用程序所需的XML配置，为更快，更高效的
开发生态系统铺平了道路。嵌入Tomcat, JettyUndertow 
而且不需要部署他们。提供的“starters” poms来简化
Maven配置。尽可能自动配置spring应用。
提供生产指标,健壮检查和外部化配置。
绝对没有代码生成和XML配置要求。

```
###### 可以说SpringBoot包括了SSM的Spirng和SpringMVC这两个核心，同时帮开发者配置集成了其他几个重要功能模块，相对于SSM简化了开发步骤并做了初始配置。

', '已发布', 0, '2022-05-08 12:10:40'),
        (22, '## 四川简阳，丈夫婚前未告知患有严重遗传性疾病，妻子起诉撤销婚姻获法院支持。
婚后不到三个月，丈夫在当地医院口腔科拔牙后，连续十多天出血不止，引起妻子怀疑。后经不断询问，并经医院确诊后，妻子才得知，原来丈夫患有严重的家族型遗传性疾病血友病A型。妻子难以接受，遂向法院起诉请求撤销婚姻，并获得法院支持。该案为《民法典》实施后，成都首例隐瞒重大疾病撤销婚姻案。
', '## 法律依据|《民法典》第1053条：
一方患有重大疾病的，应当在结婚登记前如实告知另一方；不如实告知的，另一方可以向人民法院请求撤销婚姻。', '已发布', 0, '2022-05-08 12:10:41');